importando a biblioteca que vamos usar

In [81]:
import pandas as pd

importando nossa base de dados

In [82]:
dados = pd.read_csv('vendas-por-fatura.csv')

verificando como ela está

In [83]:
dados.head()

,N° da fatura,Data da fatura,ID Cliente,País,Quantidade,Valor
0,548370,3/30/2021 16:14:00,15528.0,United Kingdom,123,"229,33"
1,575767,11/11/2021 11:11:00,17348.0,United Kingdom,163,"209,73"
2,C570727,10/12/2021 11:32:00,12471.0,Germany,-1,"-1,45"
3,549106,4/6/2021 12:08:00,17045.0,United Kingdom,1,"39,95"
4,573112,10/27/2021 15:33:00,16416.0,United Kingdom,357,"344,83"

acertando o nome das colunas para facilitar nosso trabalho

In [84]:
dados = dados.rename(columns= {
    'N° da fatura': 'num_fatura',
    'Data da fatura': 'data_fatura',
    'ID Cliente': 'id_cliente',
    'País': 'pais',
    'Quantidade': 'quantidade',
    'Valor': 'valor'
})

dados.head()

,num_fatura,data_fatura,id_cliente,pais,quantidade,valor
0,548370,3/30/2021 16:14:00,15528.0,United Kingdom,123,"229,33"
1,575767,11/11/2021 11:11:00,17348.0,United Kingdom,163,"209,73"
2,C570727,10/12/2021 11:32:00,12471.0,Germany,-1,"-1,45"
3,549106,4/6/2021 12:08:00,17045.0,United Kingdom,1,"39,95"
4,573112,10/27/2021 15:33:00,16416.0,United Kingdom,357,"344,83"

vendo o formato de cada coluna

In [85]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25953 entries, 0 to 25952
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   num_fatura   25953 non-null  object
 1   data_fatura  25953 non-null  object
 2   id_cliente   22229 non-null  float64
 3   pais         25953 non-null  object
 4   quantidade   25953 non-null  int64
 5   valor        25953 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 1.2+ MB

acertando a coluna valor e id_cliente

In [86]:
dados['valor'] = dados['valor'].str.replace(',', '.').astype(float)

In [87]:
dados['id_cliente'] = dados['id_cliente'].astype(int)
dados['id_cliente'] = dados['id_cliente'].astype(str)

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

eu fiz para inteiro para sair o .0 e dps para str para que não tenhamos mt trabalho nem prejuizo

In [ ]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Index: 22229 entries, 0 to 25951
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   num_fatura   22229 non-null  object
 1   data_fatura  22229 non-null  object
 2   id_cliente   22229 non-null  object
 3   pais         22229 non-null  object
 4   quantidade   22229 non-null  int64
 5   valor        22229 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 1.2+ MB

dropando dados vazios

In [ ]:
dados = dados.dropna()

to suspeitando que os dados negativos estão negativos tanto na quantidade como nos valores

In [ ]:
dados[dados['quantidade'] < 0]

,num_fatura,data_fatura,id_cliente,pais,quantidade,valor
2,C570727,10/12/2021 11:32:00,12471.0,Germany,-1,-1.45
10,C543628,2/10/2021 15:51:00,16558.0,United Kingdom,-5,-9.25
17,C553508,5/17/2021 13:44:00,14000.0,United Kingdom,-3,-1.95
20,C577693,11/21/2021 11:48:00,12628.0,Germany,-3,-16.85
22,C547309,3/22/2021 11:17:00,17416.0,United Kingdom,-12,-45.00
...,...,...,...,...,...,...
25936,C542910,2/1/2021 15:38:00,17511.0,United Kingdom,-15,-61.10
25943,C557061,6/16/2021 14:55:00,14895.0,United Kingdom,-5,-14.75
25944,C562147,8/3/2021 10:47:00,16180.0,United Kingdom,-7,-18.35
25947,C553519,5/17/2021 14:16:00,18218.0,United Kingdom,-2,-9.90
25948,C556518,6/13/2021 10:53:00,16794.0,United Kingdom,-2,-12.70

In [ ]:
diferenca = (dados[dados['valor'] < 0] != dados[dados['quantidade'] < 0]).any()
diferenca

num_fatura     False
data_fatura    False
id_cliente     False
pais           False
quantidade     False
valor          False
dtype: bool

conclui que onde ele negativou a quantidade por algum motivo ele negativou o valor também

In [ ]:
dados[dados['valor'] < 0] = dados[dados['valor'] < 0]*-1
dados[dados['quantidade'] < 0] = dados[dados['quantidade'] < 0]*-1

In [ ]:
dados.head()

,num_fatura,data_fatura,id_cliente,pais,quantidade,valor
0,548370,3/30/2021 16:14:00,15528,United Kingdom,123,229.33
1,575767,11/11/2021 11:11:00,17348,United Kingdom,163,209.73
2,,,,,1,1.45
3,549106,4/6/2021 12:08:00,17045,United Kingdom,1,39.95
4,573112,10/27/2021 15:33:00,16416,United Kingdom,357,344.83

In [ ]:
dados[dados['valor'] < 0]

Empty DataFrame
Columns: [num_fatura, data_fatura, id_cliente, pais, quantidade, valor]
Index: []

In [ ]:
dados.data_fatura

0         3/30/2021 16:14:00
1        11/11/2021 11:11:00
2
3          4/6/2021 12:08:00
4        10/27/2021 15:33:00
                ...
25947
25948
25949     5/13/2021 10:44:00
25950    11/17/2021 13:58:00
25951     4/14/2021 12:39:00
Name: data_fatura, Length: 22229, dtype: object

In [ ]:
dados['data_fatura'] = pd.to_datetime(dados['data_fatura'], errors='coerce')
dados.data_fatura

0       2021-03-30 16:14:00
1       2021-11-11 11:11:00
2                       NaT
3       2021-04-06 12:08:00
4       2021-10-27 15:33:00
                ...
25947                   NaT
25948                   NaT
25949   2021-05-13 10:44:00
25950   2021-11-17 13:58:00
25951   2021-04-14 12:39:00
Name: data_fatura, Length: 22229, dtype: datetime64[ns]

repare que temos alguns NaT

In [ ]:
dados = dados.dropna()

In [ ]:
dados.data_fatura

0       2021-03-30 16:14:00
1       2021-11-11 11:11:00
3       2021-04-06 12:08:00
4       2021-10-27 15:33:00
5       2021-11-16 08:38:00
                ...
25945   2021-11-28 16:47:00
25946   2021-11-07 15:37:00
25949   2021-05-13 10:44:00
25950   2021-11-17 13:58:00
25951   2021-04-14 12:39:00
Name: data_fatura, Length: 18570, dtype: datetime64[ns]

agora temos um datetime certinho

In [89]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25953 entries, 0 to 25952
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   num_fatura   25953 non-null  object
 1   data_fatura  25953 non-null  object
 2   id_cliente   22229 non-null  float64
 3   pais         25953 non-null  object
 4   quantidade   25953 non-null  int64
 5   valor        25953 non-null  float64
dtypes: float64(2), int64(1), object(3)
memory usage: 1.2+ MB

Estou bem satisfeito com o que chegamos até aqui 
vamos para o PowerBI

In [88]:
dados.to_csv('dados',index=False)